In [1]:
import pandas as pd

In [5]:
#Reading the csv file
df  = pd.read_csv(r'C:\Users\supra\Downloads\messy_data.csv')
#pandas dataset always have axis index "0"
# pandas dataset have 
#NAN : blank cell missin datapoint

In [8]:
df.head(5)

   Age       Income  Gender Product  Quantity
0   56  59544.57663  Female       D         3
1   46  36399.18997  Female     NaN         1
2   32  57140.63881  Female       D         2
3   60  69554.91903    Male       C         5
4   25  53173.80518  Female       D         2

In [9]:
# to check is there is any missing data
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 105 entries, 0 to 104
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Age       105 non-null    int64
 1   Income    94 non-null     float64
 2   Gender    105 non-null    object
 3   Product   100 non-null    object
 4   Quantity  105 non-null    int64
dtypes: float64(1), int64(2), object(2)
memory usage: 4.2+ KB

In [10]:
# summary statistics of the dataset
#to check if the data is normally distributed, if mean and median is close then 
#STD tells how far away is data is away from the mean
df.describe()

              Age         Income   Quantity
count  105.000000      94.000000  105.00000
mean    42.076190   52867.862808    3.20000
std     15.940813   29896.579420    1.44382
min     18.000000   20901.331720    1.00000
25%     31.000000   37814.315255    2.00000
50%     41.000000   48760.369705    3.00000
75%     55.000000   61644.277868    5.00000
max    120.000000  300000.000000    5.00000

In [11]:
# to see the categorical value
df.describe(include="all")

               Age         Income  Gender Product   Quantity
count   105.000000      94.000000     105     100  105.00000
unique         NaN            NaN       2       4        NaN
top            NaN            NaN  Female       D        NaN
freq           NaN            NaN      58      28        NaN
mean     42.076190   52867.862808     NaN     NaN    3.20000
std      15.940813   29896.579420     NaN     NaN    1.44382
min      18.000000   20901.331720     NaN     NaN    1.00000
25%      31.000000   37814.315255     NaN     NaN    2.00000
50%      41.000000   48760.369705     NaN     NaN    3.00000
75%      55.000000   61644.277868     NaN     NaN    5.00000
max     120.000000  300000.000000     NaN     NaN    5.00000

In [13]:
df.loc[50
       ]

Age                  45
Income      33556.01307
Gender           Female
Product               C
Quantity              5
Name: 50, dtype: object

In [14]:
df.iloc[50]

Age                  45
Income      33556.01307
Gender           Female
Product               C
Quantity              5
Name: 50, dtype: object

In [23]:
#Cleaning the dataset

In [18]:
df["Product"].isnull() #isolate the product column

0      False
1       True
2      False
3      False
4      False
       ...
100    False
101    False
102    False
103    False
104    False
Name: Product, Length: 105, dtype: bool

In [19]:
df[df["Product"].isnull()]

    Age       Income  Gender Product  Quantity
1    46  36399.18997  Female     NaN         1
34   64  40845.16974  Female     NaN         2
45   31  30330.13661    Male     NaN         5
86   43  63312.67422  Female     NaN         4
94   42  67538.11470    Male     NaN         1

In [21]:
df[df["Product"]=="D"].head()

   Age       Income  Gender Product  Quantity
0   56  59544.57663  Female       D         3
2   32  57140.63881  Female       D         2
4   25  53173.80518  Female       D         2
6   56  36554.97225    Male       D         1
8   40  72034.11928    Male       D         2

In [24]:
df[df["Income"]>40000]

     Age        Income  Gender Product  Quantity
0     56   59544.57663  Female       D         3
2     32   57140.63881  Female       D         2
3     60   69554.91903    Male       C         5
4     25   53173.80518  Female       D         2
5     38   58955.66969  Female       A         2
..   ...           ...     ...     ...       ...
95    24   63099.75454  Female       B         5
96    26   53084.75201    Male       D         3
99    61  300000.00000    Male       B         4
102   31   53254.05089    Male       B         2
104   60   69554.91903    Male       C         5

[64 rows x 5 columns]

In [26]:
df[df["Product"]=="D"].describe()

             Age        Income   Quantity
count  28.000000     26.000000  28.000000
mean   43.107143  49876.379810   2.642857
std    13.982368  14148.860233   1.445665
min    18.000000  28602.816730   1.000000
25%    32.750000  38643.331093   1.750000
50%    41.500000  48629.797555   2.000000
75%    56.250000  57109.709432   4.000000
max    64.000000  94154.951250   5.000000

In [27]:
df['Income']

0      59544.57663
1      36399.18997
2      57140.63881
3      69554.91903
4      53173.80518
          ...
100    37341.55459
101    35516.63492
102    53254.05089
103            NaN
104    69554.91903
Name: Income, Length: 105, dtype: float64

In [30]:
df['Income'].mean()

48760.369705

In [31]:
df['Income'].median()

48760.369705

In [35]:
df[df['Income']>60000].mean

<bound method NDFrame._add_numeric_operations.<locals>.mean of      Age        Income  Gender Product  Quantity
3     60   69554.91903    Male       C         5
8     40   72034.11928    Male       D         2
10    28   64250.08093  Female       B         4
17    19   61041.83526    Male       A         5
24    50   89502.92331  Female       C         2
29    44   84308.38974  Female       C         3
30    59   74343.80749  Female       A         4
31    45   62355.99615    Male       A         2
33    32   63449.45576  Female       C         5
38    24   64439.61935  Female       B         5
44    42   62748.81806    Male       C         1
49    37   94154.95125  Female       D         5
51    64   63723.26483  Female       B         3
60    57   66300.90535  Female       D         1
61    21   65074.80321    Male       A         4
67    35   79618.56795    Male       A         4
68    43   79475.52146    Male       B         1
75    32   71019.82347    Male       A         4
82    62   61845.09207  Female       D         5
86    43   63312.67422  Female     NaN         4
92    62   68734.11049    Male       C         4
94    42   67538.11470    Male     NaN         1
95    24   63099.75454  Female       B         5
99    61  300000.00000    Male       B         4
104   60   69554.91903    Male       C         5>

In [39]:
df2["Income"]  = df2["Income"].fillna(df2["Income"].mean())

In [41]:
df["Income"]

0      59544.576630
1      36399.189970
2      57140.638810
3      69554.919030
4      53173.805180
           ...
100    37341.554590
101    35516.634920
102    53254.050890
103    52867.862808
104    69554.919030
Name: Income, Length: 105, dtype: float64

In [42]:
df["Product"] = df["Product"].fillna('D')

In [43]:
df.drop_duplicates

<bound method DataFrame.drop_duplicates of      Age        Income  Gender Product  Quantity
0     56  59544.576630  Female       D         3
1     46  36399.189970  Female       D         1
2     32  57140.638810  Female       D         2
3     60  69554.919030    Male       C         5
4     25  53173.805180  Female       D         2
..   ...           ...     ...     ...       ...
100   61  37341.554590    Male       D         5
101   55  35516.634920  Female       A         3
102   31  53254.050890    Male       B         2
103   21  52867.862808    Male       B         2
104   60  69554.919030    Male       C         5

[105 rows x 5 columns]>

In [44]:
df

     Age        Income  Gender Product  Quantity
0     56  59544.576630  Female       D         3
1     46  36399.189970  Female       D         1
2     32  57140.638810  Female       D         2
3     60  69554.919030    Male       C         5
4     25  53173.805180  Female       D         2
..   ...           ...     ...     ...       ...
100   61  37341.554590    Male       D         5
101   55  35516.634920  Female       A         3
102   31  53254.050890    Male       B         2
103   21  52867.862808    Male       B         2
104   60  69554.919030    Male       C         5

[105 rows x 5 columns]

In [45]:
df.drop_duplicates(inplace=True)
df.describe

<bound method NDFrame.describe of     Age        Income  Gender Product  Quantity
0    56   59544.57663  Female       D         3
1    46   36399.18997  Female       D         1
2    32   57140.63881  Female       D         2
3    60   69554.91903    Male       C         5
4    25   53173.80518  Female       D         2
..  ...           ...     ...     ...       ...
95   24   63099.75454  Female       B         5
96   26   53084.75201    Male       D         3
97   41   28347.74972    Male       C         3
98  120   34584.33704  Female       C         5
99   61  300000.00000    Male       B         4

[100 rows x 5 columns]>